resource/schema/NewIndiaAssuranceMotorSchema/NIA_Pre_NW.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body xmlns:typ="http://iims.services/types/">
        <typ:calculatePremiumMasterElement>
            <typ:userCode>POLICYBOSS</typ:userCode>
            <typ:rolecode>SUPERUSER</typ:rolecode>
            <typ:PRetCode>0</typ:PRetCode>
            <typ:userId />
            <typ:stakeCode>BROKER</typ:stakeCode>
            <typ:roleId />
            <typ:userroleId />
            <typ:branchcode />
            <typ:PRetErr />
            <typ:polBranchCode />
            <typ:productName>PRIVATE CAR</typ:productName>
            <typ:policyHoldercode>PO00129265</typ:policyHoldercode>
            <typ:eventDate>04/06/2017</typ:eventDate>
            <typ:netPremium />
            <typ:termUnit>G</typ:termUnit>
            <typ:grossPremium />
            <typ:policyType />
            <typ:polInceptiondate>24/06/2017</typ:polInceptiondate>
            <typ:polStartdate>24/06/2017</typ:polStartdate>
            <typ:polExpirydate>23/06/2018</typ:polExpirydate>
            <typ:branchCode />
            <typ:term>1</typ:term>
            <typ:polEventEffectiveEndDate />
            <typ:productCode>PC</typ:productCode>
            <typ:policyHolderName>SRIKANT GAUTAM</typ:policyHolderName>
            <typ:productId>194398713122007</typ:productId>
            <typ:serviceTax />
            <typ:status />
            <typ:cbDetails />
            <typ:sumInsured />
            <typ:updateDate />
            <typ:policyId />
            <typ:polDetailLastUpdateDate />
            <typ:quoteNo />
            <typ:policyNo />
            <typ:policyDetailid />
            <typ:documentLink />
            <typ:polLastUpdateDate />
            <typ:properties>
                <typ:value>PolicyBoss</typ:value>
                <typ:name>channelcode</typ:name>
            </typ:properties>
            <typ:risks>
                <typ:riskCode>VEHICLE</typ:riskCode>
                <typ:riskSuminsured>0</typ:riskSuminsured>
                <typ:covers>
                    <typ:productCode>PC</typ:productCode>
                    <typ:policyDetailid />
                    <typ:coverCode>PACKAGE</typ:coverCode><!--EHMNTCOVERE/PACKAGE-->
                    <typ:productId />
                    <typ:coverExpiryDate />
                    <typ:properties>
                        <typ:value />
                        <typ:name />
                    </typ:properties>
                    <typ:properties>
                        <typ:value></typ:value>
                        <typ:name>Sum Insured for PA to Owner Driver</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>N</typ:value>
                        <typ:name>Do you want to include PA cover for unnamed person</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>5</typ:value>
                        <typ:name>No of unnamed Persons</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value></typ:value>
                        <typ:name>Individual SI for unnamed Person</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>N</typ:value>
                        <typ:name>LL to paid drivers,cleaner employed  for opn. and/or maint. of vehicle under WCA</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>0</typ:value>
                        <typ:name>Number of Legal Liable Drivers</typ:name>
                    </typ:properties>
                </typ:covers>
                <typ:properties>
                    <typ:value>N</typ:value>
                    <typ:name>New Vehicle</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>2016</typ:value>
                    <typ:name>Year of Manufacture</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>MH</typ:value> 
                    <typ:name>Registration No (1)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>01</typ:value> 
                    <typ:name>Registration No (2)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>PA</typ:value>
                    <typ:name>Registration No (3)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>1234</typ:value>
                    <typ:name>Registration No (4)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>24/06/2016</typ:value>
                    <typ:name>Date of Sale</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>24/06/2016</typ:value>
                    <typ:name>Date of Registration</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>HONDA</typ:value>
                    <typ:name>Make</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>BRIO</typ:value>
                    <typ:name>Model</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>E MT</typ:value>
                    <typ:name>Variant</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>A</typ:value>  <!--doubt-->
                    <typ:name>Vehicle Zone for Private Car</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>Petrol</typ:value>
                    <typ:name>Type of Fuel</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>N</typ:value>
                    <typ:name>In Built Bi-fuel System fitted</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Bi-fuel System Value</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value></typ:value>
                    <typ:name>Is the vehicle fitted with Anti-theft device</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>01/01/2029</typ:value>
                    <typ:name>Registration Validity Date</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>Mumbai West,Regional Transport Officer, 111-D, Ambiwali Village, Near Manish Nagar, Varsova Road, Andheri(W),  Mumbai - 400063</typ:value> 
                    <typ:name>Name and Address of Registration Authority</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>5</typ:value>
                    <typ:name>(*)Seating Capacity</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>1198</typ:value>
                    <typ:name>(*)Cubic Capacity</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>457220</typ:value>
                    <typ:name>Vehicle Invoice Value</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>12</typ:value> <!-- doubt -->
                    <typ:name>Vehicle Age in Months</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>N</typ:value>
                    <typ:name>Whether trailer attached to the vehicle</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Number of Trailers Attached</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Total IDV of the Trailer Attached</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>N</typ:value>
                    <typ:name>Extra Electrical/ Electronic fittings</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Value of Music System</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Value of AC/Fan</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Value of Lights</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value></typ:value>
                    <typ:name>Value of Other Fittings</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value></typ:value>
                    <typ:name>Total Value of Extra Electrical/ Electronic fittings</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>N</typ:value>
                    <typ:name>Non-Electrical/ Electronic fittings</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value></typ:value>
                    <typ:name>Value of Non- Electrical/ Electronic fittings</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Additional Towing Coverage Required</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Additional Towing Coverage Amount</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>Y</typ:value>
                    <typ:name>Do You Hold Valid Driving License</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>LMOTORVEH</typ:value>
                    <typ:name>License Type of Owner Driver</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>391023</typ:value>
                    <typ:name>Insureds declared Value (IDV)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value><!-- doubt = electrical + nonelectrical + bifuel -->
                    <typ:name>IDV of Accessories</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>391023</typ:value><!-- 0 doubt = IDV + electrical + nonelectrical + bifuel -->
                    <typ:name>Total IDV</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>20</typ:value>
                    <typ:name>NCB Applicable Percentage</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>Magma HDI General Insurance Co. Ltd</typ:value> <!-- doubt -->
                    <typ:name>Name of Previous Insurer</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>NA</typ:value>  <!-- doubt -->
                    <typ:name>Previous Policy Number</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>NA</typ:value> <!-- doubt -->
                    <typ:name>Address of the Previous Insurer</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>23/06/2017</typ:value>  <!-- (CarType =="Y"?"01/01/0001":PreviousPolicyEndDate ) -->
                    <typ:name>Expiry date of previous Policy</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>1000</typ:value> <!-- CubicCapacity < 1500) ? 1000 : 2000 -->
                    <typ:name>Policy Excess (Rs)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Imposed Excess (Rs)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value></typ:value>
                    <typ:name>Voluntary Excess for PC</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Loading amount for OD</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>25</typ:value>  <!-- doubt -->
                    <typ:name>OD discount (%)</typ:name>
                </typ:properties>
            </typ:risks>
        </typ:calculatePremiumMasterElement>
    </soapenv:Body>
</soapenv:Envelope>